smellsExamPratice/howToStudy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>How To Study for the Smells Exam</title>
<!-- 2015-03-25 Wed 14:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Buffalo" />


</head>
<body>
<div id="content">
<h1 class="title">How To Study for the Smells Exam</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The Basics</a></li>
<li><a href="#sec-2">2. Format</a></li>
<li><a href="#sec-3">3. Smells to Know</a></li>
<li><a href="#sec-4">4. Sample Exam Questions</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The Basics</h2>
<div class="outline-text-2" id="text-1">
<p>
The smells exam is focused on the smells discussed in Chapter 3 of
Refactoring.  The goal of the exam is to ensure you memorize the
smells, their meanings, and some of their more-obvious solution.
</p>

<p>
The exam is tricky if you don't study for it, but should be pretty
simple if you do.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Format</h2>
<div class="outline-text-2" id="text-2">
<p>
The exam will be 15 multiple choice questions, on Moodle.
</p>

<p>
The exam will be worth as much as a Small Assignment.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Smells to Know</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Refused Bequest
</li>
<li>Message Chain
</li>
<li>Data Class
</li>
<li>Primitive Obsession
</li>
<li>Combinatorial Explosion
</li>
</ol>

<p>
This one is not in Fowlers book, but we've talked about it in relation
to your CalendarParse assignment.  Basically, it's anytime you need to
have a x b things (classes, methods, etc.) where a and b are two
things you tend to add frequently.  In the CalendarParse assignment,
we have Formats x Commands codeblocks in the original code - so every
time we add a new format we need to add a new version of every command
and vice versa.
</p>

<ol class="org-ol">
<li>Long Parameter List (Don’t forget about solutions!)
</li>
<li>Shotgun Surgery
</li>
<li>Divergent Change
</li>
<li>Parallel Inheritance Hierarchies
</li>
<li>Duplicate Code (Don’t forget about <b>many</b> solutions!)
</li>
<li>Switch Statements (Don’t forget about solutions!)
</li>
<li>Temporary Field
</li>
<li>Comments
</li>
<li>Feature Envy
</li>
<li>Speculative Generality
</li>
<li>Data Clumps
</li>
<li>Middle Man
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Sample Exam Questions</h2>
<div class="outline-text-2" id="text-4">
<p>
So you can see some sample exam questions here:
[<a href="midterm-practice.pdf">midterm-practice.pdf</a>]
</p>

<p>
You can see the solutions here:
[<a href="midterm-practice-solution.pdf">midterm-practice-solution.pdf</a>]
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Buffalo</p>
<p class="date">Created: 2015-03-25 Wed 14:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
